$VAR1 = {
          'geo' => {
                     'tilt_deg' => '0',
                     'pan_deg' => '0',
                     'type' => 'static'
                   },
          'legend' => {
                        'channels' => '11',
                        'modelshort' => 'ADJ_MBAR11',
                        'text' => [
                                    'American DJ',
                                    'Mega Bar LED',
                                    '11 DMX',
                                    '',
                                    'INPUT fixture DMX No.',
                                    'Press a Fixture',
                                    'Select or Swop button',
                                    'to make the patch.'
                                  ],
                        'manufacturer' => 'American DJ',
                        'mode' => '11 DMX',
                        'model' => 'Mega Bar LED, 11 DMX',
                        'label' => [
                                     [
                                       'Handle  %2d',
                                       'h'
                                     ],
                                     [
                                       'Fixture %11s',
                                       'n'
                                     ],
                                     [
                                       'DMX     %03d',
                                       'd'
                                     ],
                                     [
                                       'Set to 11 DMX'
                                     ]
                                   ]
                      },
          'constraint' => {
                            'maxdmx' => '501',
                            'divby' => '1',
                            'mindmx' => '1'
                          },
          'patch' => {
                       'channels' => {
                                       '6' => {
                                                'name' => 'Blue 2',
                                                'val_lo' => '229',
                                                'level_pc' => '100',
                                                'bank_ul_faders' => '61',
                                                'attr' => '0',
                                                'val_hi' => '0',
                                                'bank' => '7',
                                                'val_on' => '255',
                                                'curve_dir' => 'N',
                                                'type' => 'L',
                                                'offset' => '6'
                                              },
                                       '11' => {
                                                 'name' => 'Dimmer',
                                                 'val_lo' => '0',
                                                 'level_pc' => '100',
                                                 'bank_ul_faders' => '1',
                                                 'attr' => 'H',
                                                 'val_hi' => '0',
                                                 'bank' => '1',
                                                 'val_on' => '255',
                                                 'curve_dir' => 'N',
                                                 'type' => 'H',
                                                 'offset' => '11'
                                               },
                                       '3' => {
                                                'name' => 'Blue 1',
                                                'val_lo' => '229',
                                                'level_pc' => '100',
                                                'bank_ul_faders' => '61',
                                                'attr' => '0',
                                                'val_hi' => '0',
                                                'bank' => '9',
                                                'val_on' => '255',
                                                'curve_dir' => 'N',
                                                'type' => 'L',
                                                'offset' => '3'
                                              },
                                       '7' => {
                                                'name' => 'Red 3',
                                                'val_lo' => '0',
                                                'level_pc' => '100',
                                                'bank_ul_faders' => '1',
                                                'attr' => '0',
                                                'val_hi' => '255',
                                                'bank' => '6',
                                                'val_on' => '255',
                                                'curve_dir' => 'N',
                                                'type' => 'L',
                                                'offset' => '7'
                                              },
                                       '9' => {
                                                'name' => 'Blue 3',
                                                'val_lo' => '229',
                                                'level_pc' => '100',
                                                'bank_ul_faders' => '61',
                                                'attr' => '0',
                                                'val_hi' => '0',
                                                'bank' => '5',
                                                'val_on' => '255',
                                                'curve_dir' => 'N',
                                                'type' => 'L',
                                                'offset' => '9'
                                              },
                                       '2' => {
                                                'name' => 'Green 1',
                                                'val_lo' => '0',
                                                'level_pc' => '100',
                                                'bank_ul_faders' => '61',
                                                'attr' => '0',
                                                'val_hi' => '255',
                                                'bank' => '10',
                                                'val_on' => '255',
                                                'curve_dir' => 'N',
                                                'type' => 'L',
                                                'offset' => '2'
                                              },
                                       '8' => {
                                                'name' => 'Green 3',
                                                'val_lo' => '0',
                                                'level_pc' => '100',
                                                'bank_ul_faders' => '61',
                                                'attr' => '0',
                                                'val_hi' => '255',
                                                'bank' => '6',
                                                'val_on' => '255',
                                                'curve_dir' => 'N',
                                                'type' => 'L',
                                                'offset' => '8'
                                              },
                                       '1' => {
                                                'name' => 'Red 1',
                                                'val_lo' => '0',
                                                'level_pc' => '100',
                                                'bank_ul_faders' => '1',
                                                'attr' => '0',
                                                'val_hi' => '255',
                                                'bank' => '10',
                                                'val_on' => '255',
                                                'curve_dir' => 'N',
                                                'type' => 'L',
                                                'offset' => '1'
                                              },
                                       '4' => {
                                                'name' => 'Red 2',
                                                'val_lo' => '0',
                                                'level_pc' => '100',
                                                'bank_ul_faders' => '1',
                                                'attr' => '0',
                                                'val_hi' => '255',
                                                'bank' => '8',
                                                'val_on' => '255',
                                                'curve_dir' => 'N',
                                                'type' => 'L',
                                                'offset' => '4'
                                              },
                                       '10' => {
                                                 'range' => [
                                                              [
                                                                '0',
                                                                '0',
                                                                'Open'
                                                              ],
                                                              [
                                                                '1',
                                                                '255',
                                                                'Strobe %3d%%',
                                                                '0+(((c-a)*100)/(b-a))'
                                                              ]
                                                            ],
                                                 'name' => 'Shutter',
                                                 'val_lo' => '0',
                                                 'level_pc' => '100',
                                                 'bank_ul_faders' => '61',
                                                 'attr' => 'O',
                                                 'val_hi' => '0',
                                                 'bank' => '2',
                                                 'val_on' => '0',
                                                 'curve_dir' => 'N',
                                                 'type' => 'L',
                                                 'offset' => '10'
                                               },
                                       '5' => {
                                                'name' => 'Green 2',
                                                'val_lo' => '0',
                                                'level_pc' => '100',
                                                'bank_ul_faders' => '61',
                                                'attr' => '0',
                                                'val_hi' => '255',
                                                'bank' => '8',
                                                'val_on' => '255',
                                                'curve_dir' => 'N',
                                                'type' => 'L',
                                                'offset' => '5'
                                              }
                                     },
                       'size' => '11'
                     },
          'preset' => {
                        'Colors' => [
                                      {
                                        '1' => 255,
                                        '3' => 0,
                                        'name' => 'Red',
                                        '2' => 0,
                                        '29' => '2'
                                      },
                                      {
                                        '1' => 255,
                                        '3' => 0,
                                        'name' => 'Amber',
                                        '2' => 128,
                                        '29' => '3'
                                      },
                                      {
                                        '1' => 255,
                                        '3' => 0,
                                        'name' => 'Yellow',
                                        '2' => 255,
                                        '29' => '4'
                                      },
                                      {
                                        '1' => 0,
                                        '3' => 0,
                                        'name' => 'Green',
                                        '2' => 255,
                                        '29' => '5'
                                      },
                                      {
                                        '1' => 0,
                                        '3' => 255,
                                        'name' => 'Cyan',
                                        '2' => 255,
                                        '29' => '6'
                                      },
                                      {
                                        '1' => 0,
                                        '3' => 255,
                                        'name' => 'Blue',
                                        '2' => 0,
                                        '29' => '7'
                                      },
                                      {
                                        '1' => 73,
                                        '3' => 4,
                                        'name' => 'Lavender',
                                        '2' => 252,
                                        '29' => '8'
                                      },
                                      {
                                        '1' => 128,
                                        '3' => 255,
                                        'name' => 'Purple',
                                        '2' => 0,
                                        '29' => '9'
                                      },
                                      {
                                        '1' => 255,
                                        '3' => 255,
                                        'name' => 'Magenta',
                                        '2' => 0,
                                        '29' => '10'
                                      }
                                    ]
                      }
        };
